# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'stripe/stripe-cli'

# Binaries
# brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
# brew 'stripe/stripe-cli/stripe'
# brew 'stripe/stripe-mock/stripe-mock'
brew 'svn' # Needed to install fonts
brew 'ncdu'
brew 'htop'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'imagemagick'
brew 'yarn'

# Apps
# cask '1password'
cask 'caffeine'
cask 'discord'
cask 'orbstack'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'helo'
cask 'herd'
cask 'imageoptim'
cask 'insomnia'
# cask 'pastebot'
cask 'readdle-spark'
cask 'screenflow'
cask 'slack'
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'transmit'
cask 'tunnelbear'
cask 'tuple'
cask 'visual-studio-code'
cask 'zoom'
cask 'daisydisk'
cask 'dbngin'
cask 'devtoys'
cask 'dropbox'
cask 'google-drive'
cask 'hiddenbar'
cask 'iterm2'
cask 'notion'
cask 'paw'
cask 'raycast'
cask 'rectangle'
cask 'shottr'
cask 'zulu'
cask 'arc'
cask 'jetbrains-toolbox'
cask 'monitorcontrol'
cask 'sublime-text'
cask 'microsoft-teams'
cask 'obsidian'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-cascadia-code'
cask 'font-hack'
cask 'font-fira-code'

# Mac App Store
mas 'Pocket', id: 568494494
mas 'feedly. Read more, know more.', id: 865500966
mas 'Trello', id: 1278508951
mas 'OneDrive', id: 823766827
mas 'Twitter', id: 1482454543
