# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'


# Binaries
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'svn' # Needed to install fonts
brew 'ncdu'
brew 'htop'


# Development
brew 'php'
brew 'php@8.0'
brew 'php@7.4'
brew 'composer'
brew 'imagemagick'
brew 'meilisearch'
brew 'memcached'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'

# Apps
cask 'alfred'
cask 'dropbox'
cask '1password'
cask 'caffeine'
cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'helo'
cask 'imageoptim'
cask 'insomnia'
cask 'pastebot'
cask 'phpmon'
cask 'ray'
cask 'readdle-spark'
cask 'phpstorm'
cask 'screenflow'
cask 'slack'
cask 'tableplus'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'transmit'
cask 'tunnelbear'
cask 'tuple'
cask 'visual-studio-code'
cask 'zoom'
cask 'notion'
cask 'paw'
cask 'daisydisk'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-cascadia-code'
cask 'font-hack'
cask 'font-fira-code'

# Mac App Store
#mas 'Byword', id: 420212497
#mas 'Giphy Capture', id: 668208984
mas 'Spark', id: 1176895641
#mas 'Speedtest', id: 1153157709
#mas 'Things', id: 904280696
#mas 'Tweetbot', id: 1384080005
mas 'Pocket', id: 568494494
mas 'feedly. Read more, know more.', id: 865500966
mas 'Trello', id: 1278508951
mas 'OneDrive', id: 823766827
