# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'shivammathur/php'
tap 'shivammathur/extensions'


# Binaries
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
# brew 'svn' # Needed to install fonts
brew 'ncdu'
brew 'htop'


# Development
brew 'php'
brew 'php@8.1'
brew 'php@8.0'
brew 'php@7.4'
brew 'composer'
brew 'imagemagick'
brew 'memcached'
brew 'nginx'
brew 'node'
brew 'yarn'

# Apps
cask 'alfred'
cask 'iterm2'
cask 'dropbox'
cask 'caffeine'
cask 'dbngin'
cask 'discord'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'helo'
cask 'imageoptim'
cask 'insomnia'
cask 'phpmon'
cask 'screenflow'
cask 'slack'
cask 'tableplus'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'tuple'
cask 'visual-studio-code'
cask 'zoom'
cask 'notion'
cask 'paw'
cask 'daisydisk'
cask 'raycast'
cask 'tableplus'
cask 'azure-data-studio'
cask 'openvpn-connect'
cask 'sublime-text'
cask 'shottr'
cask 'authy'
cask 'devtoys'
cask 'rocket'
cask 'vlc'
cask 'hiddenbar'
cask 'zulu11'
cask 'rocket'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'


# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-cascadia-code'
cask 'font-hack'
cask 'font-fira-code'

# Mac App Store
mas 'Spark', id: 1176895641
mas 'Pocket', id: 568494494
mas 'feedly. Read more, know more.', id: 865500966
mas 'Trello', id: 1278508951
mas 'OneDrive', id: 823766827
mas 'Microsoft To Do', id: 1274495053
# mas 'Twitter', id: 1482454543
